01_particleTracking_example/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 4e-5;

boundaryField
{

    WALL
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    HOLDER
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    STIRRER
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    BOTTOM
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    TOP
    {
        type            symmetry;

    }
   
}


// ************************************************************************* //
