01_particleTracking_example/constant/cloudPositions
/*--------------------------------*- C++ -*----------------------------------*\
 =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  9
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       vectorField;
    object      cloudPositions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

(
(-0.012486 -0.0324507 -0.0357662)
(0.0148705 -0.0249291 0.0783326)
(-0.0100436 0.0636707 0.18)
(0.0262078 -0.00760745 0.10424)
(0.0652999 -0.0284733 -0.0186674)
(0.0117136 -0.0786092 0.0483334)
(-0.0143761 -0.0812626 0.109166)
(-0.000770459 0.00563914 0.184167)
(0.0608905 0.000835475 -0.0276858)
(-0.0191674 -0.081017 0.119167)
(0.0812265 -0.0175985 0.0391669)
(-0.0574579 -0.0574594 0.170836)
(0.00751057 0.024438 0.104492)
(-0.009235 0.0766616 -0.0182255)
(-0.000839545 -0.0831412 0.0425001)
(0.0830442 0.00419653 0.0725)
(0.00251504 0.0815212 0.109167)
(0.0814615 -0.00418321 0.1475)
(-0.00251669 -0.0831078 0.185834)
(0.00248178 -0.0207092 0.209166)
)

// ************************************************************************* //