01_particleTracking_example/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

#include "$FOAM_TUTORIALS/resources/blockMesh/mixerVessel2D"

baffles
{
    baffleFaces
    {
        type    searchableSurface;
        surface searchableCylinder;
        point1 (0 0 -100);
        point2 (0 0 100);
        radius  $rotorRegion;

        patches
        {
            master
            {
                name            STIRRER;
                type            cyclicAMI;
                neighbourPatch  MRF;
            }
            slave
            {
                $master;
                name            MRF;
                neighbourPatch  STIRRER;
            }
        }
    }
}

// ************************************************************************* //
